tutorials/CFD/17YJunction/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "5";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13046
(
(0.547259 0.21643 0)
(0.61159 -0.12824 5.49552e-21)
(0.233281 -0.0696101 1.22182e-20)
(0.527361 0.129029 0)
(0.239707 0.00564357 1.11265e-20)
(0.518352 -0.138831 0)
(0.5738 0.152118 -1.63681e-21)
(0.560502 -0.175549 -2.80349e-21)
...
)
;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet1
    {
        type            fixedValue;
        value           uniform (0.70711 -0.70711 0);
    }
    inlet2
    {
        type            fixedValue;
        value           uniform (0.70711 0.70711 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
