tutorials/CFD/17YJunction/0/Uliftx1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Uliftx1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
13046
(
(0.502568 0 0)
(0.482043 0 0)
(0.370307 0 0)
(0.504847 0 0)
(0.391144 0 0)
(0.441816 0 0)
(0.523944 0 0)
(0.445359 0 0)
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet1
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet2
    {
        type            calculated;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
30
(
(0.56055 0 0)
(0.611097 0 0)
(0.641335 0 0)
(0.661833 0 0)
(0.676804 0 0)
(0.688162 0 0)
(0.696878 0 0)
(0.703499 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
